<h1>Group 1 Transactions Final Project

<h2>Import Dependencies

In [4]:
import pandas as pd
import numpy as np

<h2>Import and check data

In [5]:
excel_data = pd.read_excel("datasets/ISE_CoffeeTransaction_April2023.xlsx", sheet_name = None)

dataframes = {}

for sheet_name, sheet_data in excel_data.items():
    dataframes[sheet_name] = sheet_data
    
transactions = dataframes["Transactions"]
account = dataframes["Account"]
location = dataframes["location"]
product = dataframes["Product"]

In [9]:
transactions.head()

,transaction_id,Account_id,transaction_amount,transaction_date,time_to_purchase,gas_type,gas_price_purchase,product_id,Location
0,23,1004,2.50,2023-01-01,19:00:00,NaN,0.00,1,7
1,41666,1013,65.77,2023-01-01,11:00:00,A,65.77,7,7
2,6321,1014,37.80,2023-01-01,12:00:00,B,37.80,10,7
3,34042,1015,3.00,2023-01-01,15:00:00,NaN,0.00,2,7
4,1006,1016,3.00,2023-01-01,16:00:00,NaN,0.00,2,7

In [10]:
account.head()

   Account_id   Age  Register Date Unnamed: 3
0        1001  31.0            NaN
1        1002  29.0            NaN
2        1003  54.0            NaN
3        1004  28.0            NaN
4        1005  64.0   '2022-10-02'

In [12]:
location.head()

   Location Location Detail   Latitude  Longtitude
0         1   CentralWorld   13.746680  100.539067
1         2   Siam Paragon   13.746464  100.534566
2         3    Mega Bangna   13.660615  100.609743
3         4  Silom Complex   13.725744  100.531582
4         5    The Crystal   13.787408  100.571691

In [13]:
product.head()

,product_id,product_name,product_description,product_category,product_price
0,1,Coffee,Hot brewed coffee,Beverage,2.5
1,2,Croissant,Flaky and buttery pastry,Pastry,3.0
2,3,Tea,Tea with milk and sugar,Beverage,2.0
3,4,Muffin,Freshly baked muffin,Pastry,3.5
4,5,Bagel,Toasted bagel with cream cheese,Pastry,3.0